In [49]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('op_seasons.csv')

In [3]:
data.head()

,Season,Season title,Episodes,Unnamed: 3,Originally aired,Unnamed: 5,Total Epidsodes
0,NaN,NaN,NaN,NaN,First aired,Last aired,NaN
1,1.0,East Blue[1],61.0,NaN,"October 20, 1999 (1999-10-20)","March 14, 2001 (2001-03-14)",61.0
2,2.0,Entering into the Grand Line,16.0,NaN,"March 21, 2001 (2001-03-21)","August 19, 2001 (2001-08-19)",77.0
3,3.0,Introducing Chopper at the Winter Island,14.0,NaN,"August 26, 2001 (2001-08-26)","December 9, 2001 (2001-12-09)",91.0
4,4.0,"Arrival in Alabasta, Fierce Fighting in Alabasta",39.0,NaN,"December 16, 2001 (2001-12-16)","October 27, 2002 (2002-10-27)",NaN

In [4]:
# Drop columns based on column index.
data = data.drop(data.columns[4],axis = 1)

In [6]:
data.head()

,Season,Season title,Episodes,Unnamed: 3,Unnamed: 5,Total Epidsodes
0,NaN,NaN,NaN,NaN,Last aired,NaN
1,1.0,East Blue[1],61.0,NaN,"March 14, 2001 (2001-03-14)",61.0
2,2.0,Entering into the Grand Line,16.0,NaN,"August 19, 2001 (2001-08-19)",77.0
3,3.0,Introducing Chopper at the Winter Island,14.0,NaN,"December 9, 2001 (2001-12-09)",91.0
4,4.0,"Arrival in Alabasta, Fierce Fighting in Alabasta",39.0,NaN,"October 27, 2002 (2002-10-27)",NaN

In [11]:
data.columns

Index(['Season', 'Season title', 'Episodes', 'Unnamed: 3', 'Unnamed: 5',
       'Total Epidsodes '],
      dtype='object')

In [13]:
data = data.drop(data.columns[[3, 4]], axis=1)

In [14]:
data.head()

,Season,Season title,Episodes,Total Epidsodes
0,NaN,NaN,NaN,NaN
1,1.0,East Blue[1],61.0,61.0
2,2.0,Entering into the Grand Line,16.0,77.0
3,3.0,Introducing Chopper at the Winter Island,14.0,91.0
4,4.0,"Arrival in Alabasta, Fierce Fighting in Alabasta",39.0,NaN

In [19]:
data = data.drop(data.index[0])

In [27]:
episodes = data['Episodes']

In [46]:
total = 0
total_array = []
for i in range(len(episodes)):
    total += episodes.values[i]
    total_array.append(total)

In [50]:
data.head()

,Season,Season title,Episodes,Total Epidsodes
1,1.0,East Blue[1],61.0,61.0
2,2.0,Entering into the Grand Line,16.0,77.0
3,3.0,Introducing Chopper at the Winter Island,14.0,91.0
4,4.0,"Arrival in Alabasta, Fierce Fighting in Alabasta",39.0,NaN
5,5.0,"Dreams!, The Zenny Pirate Crew Sortie!, Beyond...",13.0,NaN

In [54]:
data = data.drop(data.columns[3], axis=1)

In [56]:
data.head()

   Season                                       Season title  Episodes
1     1.0                                       East Blue[1]      61.0
2     2.0                       Entering into the Grand Line      16.0
3     3.0           Introducing Chopper at the Winter Island      14.0
4     4.0   Arrival in Alabasta, Fierce Fighting in Alabasta      39.0
5     5.0  Dreams!, The Zenny Pirate Crew Sortie!, Beyond...      13.0

In [57]:
np_array = np.array(total_array)

In [58]:
data['Total_episodes_till_arc'] = np_array.tolist()

In [62]:
data.to_csv('One_Piece_Episodes.csv', index=False)